uliano/brio/brio/stm32g0/device_tables.hpp
constexpr bool spi_present(uint8_t n) { return spi_base(n) != 0u; }

/// Which APB enable/reset register carries SPIn, and which bit. SPI1 is
/// the one APB2 instance (as USART1 is); SPI2 and SPI3 sit on APBENR1.
/// The two registers' bit numbers are the same in APBENRx and APBRSTRx,
/// so one mask serves both (the enable macro is the one probed).
struct SpiBusClock {
    bool apb2 = false;
    uint32_t mask = 0;
};

constexpr SpiBusClock spi_bus_clock(uint8_t n) {
    switch (n) {
#if defined(RCC_APBENR2_SPI1EN)
        case 1: return {true, RCC_APBENR2_SPI1EN};
#endif
#if defined(RCC_APBENR1_SPI2EN)
        case 2: return {false, RCC_APBENR1_SPI2EN};
#endif
#if defined(RCC_APBENR1_SPI3EN)
        case 3: return {false, RCC_APBENR1_SPI3EN};
#endif
        default: return {};
    }
}

/// The NVIC line of SPIn, DERIVED FROM PRESENCE like usart_irq() and
/// tim_irq(): SPI1 has its own line everywhere, and SPI2's line is
/// SPI2_3_IRQn on a part that HAS a SPI3 and SPI2_IRQn where none does -
/// so SPI3_BASE is the probe, and a header that named the shared line
/// otherwise would fail to compile here rather than bind a wrong vector
/// in silence. NonMaskableInt_IRQn for an instance the device has not
/// got: unreachable, Spi<n> refusing it first.
constexpr IRQn_Type spi_irq(uint8_t n) {
    switch (n) {
        case 1: return SPI1_IRQn;
#if defined(SPI3_BASE)
        case 2: case 3: return SPI2_3_IRQn;
#else
        case 2: return SPI2_IRQn;
#endif
        default: return NonMaskableInt_IRQn;
    }
}

/// Whether SPIn can also be an I2S (table 205's "I2S support" row): SPI1
/// everywhere, SPI2 only on the G0Bx/G0Cx, SPI3 nowhere.
///
/// THE SPI3 PROBE IS THE RULE, and it is the reserve's usual presence
/// derivation rather than a copied list: table 205's footnote 1 marks
/// I2S2 and SPI3 with the SAME condition ("applies to STM32G0B1xx and
/// STM32G0C1xx only"), so the part that has a third SPI is exactly the
/// part whose second SPI carries an I2S. The device header's own answer
/// is IS_I2S_ALL_INSTANCE(x), a POINTER COMPARISON and therefore not a
/// constant expression (the IS_UART_FIFO_INSTANCE story again) - it
/// lists SPI1 alone on every smaller header and SPI1 + SPI2 on the
/// G0Bx/G0Cx, which is what this function states; Spi<n>::has_i2s()
/// reads that macro at run time and the bench compares the two.
///
/// The register FIELDS are no help: every header of the pack declares
/// I2SCFGR, I2SPR and all their bit macros for the one SPI_TypeDef every
/// instance is mapped through, so nothing in the register description
/// distinguishes an instance that has the mode from one that has not.
constexpr bool spi_has_i2s(uint8_t n) {
    if (!spi_present(n)) {
        return false;
    }
#if defined(SPI3_BASE)
    return n <= 2;
#else
    return n == 1;
#endif
}

/// Where I2Sn's kernel-clock selector sits, and in WHICH register - the
/// one fact of this chapter that really moves across the family. On the
/// G0Bx/G0Cx both selectors are RCC_CCIPR2 fields (I2S1SEL at bit 0,
/// I2S2SEL at bit 2, 5.4.22); on every smaller part there is one I2S and
/// its selector is RCC_CCIPR bits 15:14, the field the manual spells
/// I2C2I2S1SEL because the same two bits select I2C2's clock on the big
/// parts and I2S1's on the small ones (5.4.21's own note).
///
/// `pos` is 0xFF when the instance has no I2S at all. The four codes are
/// the same in both places: 00 SYSCLK, 01 PLLPCLK, 10 HSI16, 11 I2S_CKIN.
struct I2sClockSelect {
    uint8_t pos = 0xFF;   ///< bit position of the 2-bit field
    bool ccipr2 = false;  ///< true = RCC_CCIPR2, false = RCC_CCIPR
};

constexpr I2sClockSelect i2s_clock_select(uint8_t n) {
    if (!spi_has_i2s(n)) {
        return {};
    }
#if defined(RCC_CCIPR2_I2S1SEL_Pos)
    switch (n) {
        case 1: return {RCC_CCIPR2_I2S1SEL_Pos, true};
#if defined(RCC_CCIPR2_I2S2SEL_Pos)
        case 2: return {RCC_CCIPR2_I2S2SEL_Pos, true};
#endif
        default: return {};
    }
#elif defined(RCC_CCIPR_I2S1SEL_Pos)
    return n == 1u ? I2sClockSelect{RCC_CCIPR_I2S1SEL_Pos, false} : I2sClockSelect{};
#else
    (void)n;
    return {};
#endif
}

/// The DMAMUX request lines SPIn publishes (RM0444 table 56). They live
/// HERE rather than beside the instance because they are a per-part
/// TABLE and not a register field - the same reason the LPTIM's trigger
/// input does - and because SPI3's pair (66/67) is a long way from
/// SPI1/SPI2's contiguous block. No device header of this pack declares
/// them: the DMAMUX_REQ_* spellings are ST's HAL, which this project
/// does not vendor.
constexpr uint8_t spi_dma_rx_request(uint8_t n) {
    switch (n) {
        case 1: return 16;
        case 2: return 18;
        case 3: return 66;
        default: return 0;
    }
}
constexpr uint8_t spi_dma_tx_request(uint8_t n) {
    switch (n) {
        case 1: return 17;
        case 2: return 19;
        case 3: return 67;
        default: return 0;
    }
}

// ---- I2C instances (RM0444 ch. 32) ------------------------------------------
//
// One chapter, three instances that are NOT copies of each other, and the
// split is table 165's: every instance does 7- and 10-bit addressing at
// all three speeds, but the INDEPENDENT CLOCK, the WAKE FROM STOP and the
// SMBus half belong to I2C1 always, to I2C2 only on the G0B1/G0C1 class,
// and to I2C3 nowhere.

/// Register block base of I2Cn (n = 1..3), 0 when the device has not got
/// it. I2C1 and I2C2 sit on every G0 of the pack; I2C3 is the
/// G0Bx/G0Cx's alone (table 165's footnote 2), and the header says so
/// with I2C3_BASE. NOTE THE ADDRESS IS NOT CONTIGUOUS with the other
/// two (0x8800 against 0x5400/0x5800), so this is a switch and not
/// arithmetic - the SPI3 story again.
constexpr uint32_t i2c_base(uint8_t n) {
    switch (n) {
#if defined(I2C1_BASE)
        case 1: return I2C1_BASE;
#endif
#if defined(I2C2_BASE)
        case 2: return I2C2_BASE;
#endif
#if defined(I2C3_BASE)
        case 3: return I2C3_BASE;
#endif
        default: return 0;
    }
}

constexpr bool i2c_present(uint8_t n) { return i2c_base(n) != 0u; }

/// Which APBENR1/APBRSTR1 bit carries I2Cn. EVERY I2C of this family is
/// on APB1 (bits 21, 22, 23), so - unlike SpiBusClock and UsartBusClock -
/// there is no register to choose and the answer is a bare mask. The two
/// registers' bit numbers coincide, so one mask serves the enable and the
/// reset alike (the enable macro is the one probed).
constexpr uint32_t i2c_bus_clock(uint8_t n) {
    switch (n) {
#if defined(RCC_APBENR1_I2C1EN)
        case 1: return RCC_APBENR1_I2C1EN;
#endif
#if defined(RCC_APBENR1_I2C2EN)
        case 2: return RCC_APBENR1_I2C2EN;
#endif
#if defined(RCC_APBENR1_I2C3EN)
        case 3: return RCC_APBENR1_I2C3EN;
#endif
        default: return 0;
    }
}

/// The NVIC line of I2Cn, DERIVED FROM PRESENCE exactly as spi_irq() is:
/// I2C1 has its own line everywhere, and I2C2's line is I2C2_3_IRQn on a
/// part that HAS an I2C3 and I2C2_IRQn where none does - so I2C3_BASE is
/// the probe. NonMaskableInt_IRQn for an instance the device has not got:
/// unreachable, I2c<n> refusing it first.
constexpr IRQn_Type i2c_irq(uint8_t n) {
    switch (n) {
        case 1: return I2C1_IRQn;
#if defined(I2C3_BASE)
        case 2: case 3: return I2C2_3_IRQn;
#else
        case 2: return I2C2_IRQn;
#endif
        default: return NonMaskableInt_IRQn;
    }
}

/// Whether I2Cn has the INDEPENDENT CLOCK of table 165 - a kernel clock
/// of its own, selected in RCC_CCIPR, rather than PCLK for both the
/// kernel and the registers (32.4.1: "the instances not supporting the
/// independent clock function use PCLK for clocking both").
///
/// THIS ONE THE HEADER REALLY ANSWERS, and it answers it with a name and
/// not a base: RCC_CCIPR_I2C2SEL_Pos exists on exactly the headers whose
/// I2C2 has the feature. The manual calls that field I2C2I2S1SEL because
/// bits 15:14 select I2C2's clock on the big parts and I2S1's on the
/// small ones (5.4.21's own note - i2s_clock_select() states it from the
/// other side); CMSIS splits the two readings into two macro names, so
/// which name a header declares IS the presence probe.
constexpr bool i2c_has_independent_clock(uint8_t n) {
    if (!i2c_present(n)) {
        return false;
    }
    if (n == 1u) {
        return true;
    }
#if defined(RCC_CCIPR_I2C2SEL_Pos)
    return n == 2u;
#else
    return false;
#endif
}

