uliano/brio/brio/stm32g0/device_tables.hpp
/// TIMx_BDTR - break inputs, the dead-time generator, MOE and the off
/// states. Exactly the timers with a complementary output (21.4.18,
/// 25.5.16, 25.6.14).
constexpr bool tim_has_break(uint8_t n) { return tim_complementary_channels(n) != 0u; }

/// TIMx_RCR - the repetition counter (an update event every RCR + 1
/// periods). The same four timers again.
constexpr bool tim_has_repetition(uint8_t n) { return tim_has_break(n); }

/// CR1.DIR and CR1.CMS: up/down and centre-aligned counting. DS13560
/// table 7's "counter type" column - only TIM1..TIM4 count anything but
/// up.
constexpr bool tim_has_direction(uint8_t n) {
    switch (n) {
        case 1: case 2: case 3: case 4: return tim_present(n);
        default: return false;
    }
}
constexpr bool tim_has_center_aligned(uint8_t n) { return tim_has_direction(n); }

/// TIMx_TISEL, the input multiplexer that makes a capture channel
/// reachable with no pad at all (an internal clock, a comparator). Every
/// timer with a channel has one; the basic timers have no input.
constexpr bool tim_has_tisel(uint8_t n) { return tim_channels(n) != 0u; }

/// TIMx_DCR/TIMx_DMAR, the DMA burst engine (DS13560 table 7's "DMA
/// request generation"): everything but TIM14.
constexpr bool tim_has_dma_burst(uint8_t n) {
    switch (n) {
        case 1: case 2: case 3: case 4: case 6: case 7: case 15: case 16: case 17:
            return tim_present(n);
        default: return false;
    }
}

/// TIMx_ETR, the external trigger input (SMCR's ECE/ETP/ETPS/ETF half).
/// The timers with a slave controller have it; TIM15 does not (25.5.3
/// gives it ITRx and the TI inputs and no ETR).
constexpr bool tim_has_external_trigger(uint8_t n) {
    switch (n) {
        case 1: case 2: case 3: case 4: return tim_present(n);
        default: return false;
    }
}

/// Whether TIMn_AF1.ETRSEL can select the MCO output as the external
/// trigger source - and THIS IS A PER-PART TABLE CELL, not a register
/// field. RM0444 22.4.25 lists the ETR sources 0000 ETR legacy, 0001
/// COMP1, 0010 COMP2, 0011 LSE, 0100 MCO, 0101 MCO2, 0110 COMP3, and
/// footnotes the last THREE "available on STM32G0B1xx and STM32G0C1xx
/// sales types only"; on every smaller part those codes are Reserved and
/// select nothing at all, so a timer told to take MCO simply does not
/// count. Nothing in the register description says so and no TIM_* macro
/// differs between the headers - one TIM_TypeDef serves every instance
/// on every part - which is why the probe is the CLASS the footnote
/// names, asked the only way a preprocessor can ask it: MCO2 is that
/// class's own second clock output and RCC_CFGR_MCO2SEL_Pos exists on
/// exactly the headers whose ETRSEL carries the three footnoted codes.
///
/// The LSE code (0011) is every part's, which is what makes a
/// SYSCLK-independent wall buildable on all of them - it is only the
/// RATE that changes.
constexpr bool tim_etrsel_has_mco(uint8_t n) {
    if (!tim_has_external_trigger(n)) {
        return false;
    }
#if defined(RCC_CFGR_MCO2SEL_Pos)
    return true;
#else
    return false;
#endif
}

/// The NVIC line TIMn's UPDATE, capture/compare, trigger and break
/// events reach. SHARED LINES ARE THE RULE HERE (table 61): TIM3 shares
/// with TIM4 where there is a TIM4, TIM6 with the DAC and LPTIM1 where
/// there are those, TIM7 with LPTIM2, TIM16 and TIM17 with the two FDCAN
/// interrupt lines - and TIM1 alone has TWO vectors, the capture/compare
/// one being separate (see tim_cc_irq). IRQn values are enumerators the
/// preprocessor cannot probe, so each line's name is DERIVED FROM THE
/// PRESENCE of what shares it, exactly as usart_irq() does; a wrong
/// line here is a silent Default_Handler spin, which is what the family
/// fixture instantiating every present instance on every header is for.
/// NonMaskableInt_IRQn for a timer the device has not got - unreachable,
/// Tim<n> refusing it first.
constexpr IRQn_Type tim_irq(uint8_t n) {
    switch (n) {
        case 1: return TIM1_BRK_UP_TRG_COM_IRQn;
#if defined(TIM2_BASE)
        case 2: return TIM2_IRQn;
#endif
#if defined(TIM4_BASE)
        case 3: case 4: return TIM3_TIM4_IRQn;
#else
        case 3: return TIM3_IRQn;
#endif
#if defined(TIM6_BASE) && (defined(DAC1_BASE) || defined(LPTIM1_BASE))
        case 6: return TIM6_DAC_LPTIM1_IRQn;
#elif defined(TIM6_BASE)
        case 6: return TIM6_IRQn;
#endif
#if defined(TIM7_BASE) && defined(LPTIM2_BASE)
        case 7: return TIM7_LPTIM2_IRQn;
#elif defined(TIM7_BASE)
        case 7: return TIM7_IRQn;
#endif
        case 14: return TIM14_IRQn;
#if defined(TIM15_BASE)
        case 15: return TIM15_IRQn;
#endif
#if defined(FDCAN1_BASE)
        case 16: return TIM16_FDCAN_IT0_IRQn;
        case 17: return TIM17_FDCAN_IT1_IRQn;
#else
        case 16: return TIM16_IRQn;
        case 17: return TIM17_IRQn;
#endif
        default: return NonMaskableInt_IRQn;
    }
}

/// TIM1's SECOND vector, the capture/compare one (table 61 position 14).
/// Every other timer of this family reports everything on one line, so
/// this equals tim_irq(n) there - which is what lets a handler bind both
/// without asking whether they are two.
constexpr IRQn_Type tim_cc_irq(uint8_t n) {
    return n == 1u ? TIM1_CC_IRQn : tim_irq(n);
}

/// Do TIMn's update/trigger/break and its capture/compare events reach
/// two DIFFERENT vectors? True for TIM1 alone.
constexpr bool tim_has_split_vector(uint8_t n) { return n == 1u && tim_present(n); }

// ---- LPTIM instances (RM0444 ch. 26) ----------------------------------------

/// Register block base of LPTIMn (n = 1, 2), 0 when the device does not
/// have it. Every STM32G0x1 of this pack carries both, but the probe is
/// still the header's and not a claim of this file's.
constexpr uint32_t lptim_base(uint8_t n) {
    switch (n) {
#if defined(LPTIM1_BASE)
        case 1: return LPTIM1_BASE;
#endif
#if defined(LPTIM2_BASE)
        case 2: return LPTIM2_BASE;
#endif
        default: return 0;
    }
}

constexpr bool lptim_present(uint8_t n) { return lptim_base(n) != 0u; }

/// RCC_APBENR1 bit that clocks LPTIMn. Both instances are APB1's on
/// this family (5.4.19), so there is no bus question to answer here as
/// there is for the timers and the USARTs.
constexpr uint32_t lptim_bus_clock_mask(uint8_t n) {
    switch (n) {
#if defined(RCC_APBENR1_LPTIM1EN)
        case 1: return RCC_APBENR1_LPTIM1EN;
#endif
#if defined(RCC_APBENR1_LPTIM2EN)
        case 2: return RCC_APBENR1_LPTIM2EN;
#endif
        default: return 0;
    }
}

/// RCC_APBRSTR1 bit that resets LPTIMn. This one is not a convenience:
/// ES0548 2.8.1's workaround makes the RCC reset THE ONLY WAY the driver
/// turns an LPTIM off, so a missing bit here would be a driver with no
/// disable at all - which is why it is probed and not assumed.
constexpr uint32_t lptim_reset_mask(uint8_t n) {
    switch (n) {
#if defined(RCC_APBRSTR1_LPTIM1RST)
        case 1: return RCC_APBRSTR1_LPTIM1RST;
#endif
#if defined(RCC_APBRSTR1_LPTIM2RST)
        case 2: return RCC_APBRSTR1_LPTIM2RST;
#endif
        default: return 0;
    }
}

