uliano/brio/brio/stm32g0/device_tables.hpp
// ---- PWR: what the low-power chapter's option space costs per part ---------
//
// Chapter 4 is the first in this stratum whose OWN register fields are
// per-variant, rather than a peripheral being present or absent:
//  - the six wake-up pins WKUPx are a SPARSE set (the G031 bonds 1, 2, 4
//    and 6; the G071 adds 5; only the G0B1/G0C1 has all six), and a
//    missing one has no EWUPx bit, no WPx polarity bit, no WUFx flag and
//    no CWUFx clear - four registers agreeing, so one probe answers for
//    all four;
//  - the Standby pull-up/pull-down registers follow the GPIO bonding
//    (PWR_PUCRE/PWR_PDCRE are the G0B1/G0C1's alone, exactly as GPIOE is),
//    and they are STRUCT MEMBERS: a part without them cannot even have
//    the address taken, which is why the accessor below returns a pointer;
//  - VDDIO2 exists only where the second I/O supply does.

/// Which of WKUP1..6 this part bonds, as a mask with bit 0 = WKUP1 -
/// the shape PWR_CR3.EWUPx, PWR_CR4.WPx, PWR_SR1.WUFx and PWR_SCR.CWUFx
/// all share.
constexpr uint8_t pwr_wakeup_pin_mask = 0u
#if defined(PWR_CR3_EWUP1)
    | (1u << 0)
#endif
#if defined(PWR_CR3_EWUP2)
    | (1u << 1)
#endif
#if defined(PWR_CR3_EWUP3)
    | (1u << 2)
#endif
#if defined(PWR_CR3_EWUP4)
    | (1u << 3)
#endif
#if defined(PWR_CR3_EWUP5)
    | (1u << 4)
#endif
#if defined(PWR_CR3_EWUP6)
    | (1u << 5)
#endif
    ;

/// Is WKUPn (n = 1..6) bonded on this part?
constexpr bool pwr_wakeup_pin_present(uint8_t n) {
    return n >= 1u && n <= 6u &&
           (pwr_wakeup_pin_mask & (1u << (n - 1u))) != 0u;
}

/// How many of them there are (for a sweep that must not walk past the
/// end of the part).
constexpr uint8_t pwr_wakeup_pin_count() {
    uint8_t n = 0;
    for (uint8_t i = 1; i <= 6u; ++i) {
        if (pwr_wakeup_pin_present(i)) {
            ++n;
        }
    }
    return n;
}

/// PWR_PUCRx for port `letter`, null where the part has no such
/// register. A POINTER and not a mask, because these are struct members
/// and the absent ones cannot be named at all (4.4.8 and its
/// neighbours: x = A, B, C, D, E, F, with E the G0B1/G0C1's alone).
inline volatile uint32_t* pwr_pullup_reg(char letter) {
    switch (letter) {
#if defined(GPIOA_BASE)
        case 'A': return &PWR->PUCRA;
#endif
#if defined(GPIOB_BASE)
        case 'B': return &PWR->PUCRB;
#endif
#if defined(GPIOC_BASE)
        case 'C': return &PWR->PUCRC;
#endif
#if defined(GPIOD_BASE)
        case 'D': return &PWR->PUCRD;
#endif
#if defined(GPIOE_BASE)
        case 'E': return &PWR->PUCRE;
#endif
#if defined(GPIOF_BASE)
        case 'F': return &PWR->PUCRF;
#endif
        default: return nullptr;
    }
}

/// PWR_PDCRx for port `letter`, null where absent.
inline volatile uint32_t* pwr_pulldown_reg(char letter) {
    switch (letter) {
#if defined(GPIOA_BASE)
        case 'A': return &PWR->PDCRA;
#endif
#if defined(GPIOB_BASE)
        case 'B': return &PWR->PDCRB;
#endif
#if defined(GPIOC_BASE)
        case 'C': return &PWR->PDCRC;
#endif
#if defined(GPIOD_BASE)
        case 'D': return &PWR->PDCRD;
#endif
#if defined(GPIOE_BASE)
        case 'E': return &PWR->PDCRE;
#endif
#if defined(GPIOF_BASE)
        case 'F': return &PWR->PDCRF;
#endif
        default: return nullptr;
    }
}

/// Does this part carry the second I/O supply, and with it PWR_CR2's
/// VDDIO2 monitor and PWR_SR2's flag for it (4.4.2, note on
/// PVM_VDDIO2)?
constexpr bool pwr_vddio2_present() {
#if defined(PWR_CR2_PVM_VDDIO2)
    return true;
#else
    return false;
#endif
}

/// PWR_CR2 - the programmable voltage detector and the supply monitors
/// live in it, and THE VALUE LINE HAS NO SUCH REGISTER: its PWR_TypeDef
/// reserves offset 0x04, with no PVD and no PVM on the part. A STRUCT
/// MEMBER that the x1 headers declare and the x0 headers do not; pwr.hpp
/// reaches it under the header's own symbol (a pointer probe here would
/// cost every x1 image a literal - the flash bank-1 note above), and
/// what this file exports is the presence and the masks.

/// The PVD's three fields and its output flag, mask 0 where the part has
/// no detector (every x0).
constexpr bool pwr_pvd_present() {
#if defined(PWR_CR2_PVDE)
    return true;
#else
    return false;
#endif
}
constexpr uint32_t pwr_cr2_pvd_enable =
#if defined(PWR_CR2_PVDE)
    PWR_CR2_PVDE;
#else
    0u;
#endif
constexpr uint32_t pwr_cr2_pvd_rise_mask =
#if defined(PWR_CR2_PVDRT_Msk)
    PWR_CR2_PVDRT_Msk;
#else
    0u;
#endif
constexpr uint8_t pwr_cr2_pvd_rise_pos =
#if defined(PWR_CR2_PVDRT_Pos)
    PWR_CR2_PVDRT_Pos;
#else
    0u;
#endif
constexpr uint32_t pwr_cr2_pvd_fall_mask =
#if defined(PWR_CR2_PVDFT_Msk)
    PWR_CR2_PVDFT_Msk;
#else
    0u;
#endif
constexpr uint8_t pwr_cr2_pvd_fall_pos =
#if defined(PWR_CR2_PVDFT_Pos)
    PWR_CR2_PVDFT_Pos;
#else
    0u;
#endif
constexpr uint32_t pwr_sr2_pvd_output =
#if defined(PWR_SR2_PVDO)
    PWR_SR2_PVDO;
#else
    0u;
#endif

/// The DAC supply monitor (PVMEN_DAC / PVMO_DAC): present exactly where
/// the DAC is, absent on the value line with it.
constexpr uint32_t pwr_cr2_dac_monitor_enable =
#if defined(PWR_CR2_PVMEN_DAC)
    PWR_CR2_PVMEN_DAC;
#else
    0u;
#endif
constexpr uint32_t pwr_sr2_dac_monitor_output =
#if defined(PWR_SR2_PVMO_DAC)
    PWR_SR2_PVMO_DAC;
#else
    0u;
#endif

/// PWR_CR3.RRS (SRAM retention through Standby) and ENB_ULP (the sampled
/// supply monitor): the x1 line's. The value line's Standby keeps no
/// SRAM and its supply monitor is never sampled - the bits do not exist.
constexpr uint32_t pwr_cr3_sram_retention =
#if defined(PWR_CR3_RRS)
    PWR_CR3_RRS;
#else
    0u;
#endif
constexpr uint32_t pwr_cr3_sampled_supply_monitor =
#if defined(PWR_CR3_ENB_ULP)
    PWR_CR3_ENB_ULP;
#else
    0u;
#endif

/// The EXTI lines the RTC and the TAMP raise (table 65: 19 and 21, both
/// DIRECT - no trigger selection and no pending bit in the EXTI). The
/// NUMBERS are the manual's, like comp_exti_line()'s, which is why they
/// live here.
constexpr uint8_t rtc_exti_line = 19;
constexpr uint8_t tamp_exti_line = 21;

